<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<html>
	<head>
		<title>
			{ RIA-utveckling med JavaScript }
		</title>
		<meta http-equiv="content-type" content="text/html; charset=utf-8">
		<link rel="stylesheet" href="style/krawnav.css" type="text/css">
		<link rel="stylesheet" href="style/style.css" type="text/css">
		<!-- Syntax Highlighter stylesheets -->
		<link rel="stylesheet" href="syntaxhighlighter/shCore.css" type="text/css">
		<link rel="stylesheet" href="syntaxhighlighter/shThemeDefault.css" type="text/css">
	</head>
	<body>
		<div id="wrapper">
			<div id="krawnavbutton"></div>
			<div id="krawnavcontainer"></div>
			<div id="mainhead">
				{ RIA-utveckling med JavaScript 2012 }
			</div>
			<div id="main">
				<h1>
					Information
				</h1>
				<p>
Här hittar du övergripande information om kursen.
				</p>
				<h2>Presentation</h2>

				<p>Kursen RIA-utveckling med JavaScript syftar till att l&auml;ra ut <strong>best-practices</strong> g&auml;llande just RIA-utveckling med JavaScript. Detta g&ouml;rs genom att - you guessed it - bygger en RIA (Rich Internet Application) i JavaScript!</p>
				<p>Den st&ouml;rsta delen av kursen handlar om detta bygge. Fokus &auml;r inte p&aring; m&aring;let utan p&aring; <strong>processen</strong>. Applikationens omfattning kommer d&auml;rf&ouml;r vara n&aring;got mindre &auml;n vad ni kanske &auml;r vana vid fr&aring;n andra kurser, just f&ouml;r att ge plats &aring;t p&aring;l&auml;sning, reflektion och diskussion ang&aring;ende <strong>metodiken</strong> i bygget.</p>
				<p>Under arbetets g&aring;ng kommer ni ha regelbunden <strong>handledning av l&auml;rare</strong> &ouml;ver Skype, just f&ouml;r att h&aring;lla diskussionen levande. JavaScript &auml;r ett ovanligt dynamiskt och expressivt spr&aring;k vilket g&ouml;r det v&auml;ldigt kraftfullt, men samtidigt ocks&aring; mindre sj&auml;lvklart hur applikationer b&auml;st konstrueras och kod organiseras.&nbsp;</p>
				<p>Ni kommer ocks&aring; f&aring; tillf&auml;llen att <strong>diskutera med varandra</strong>, b&aring;de generellt p&aring; kursens forum men ocks&aring; mer direkt via kollaborering i varandras projekt.</p>
				<p>Kursen avslutas med en <strong>djupdykning</strong> i n&aring;gon av de tekniker eller teknologier ni anv&auml;nt i er applikation. Denna djupdykning resulterar sedan i en presentation som alla kursdeltagare kan ta del av.</p>
				<p>F&ouml;rhoppningen &auml;r att detta sammantaget kommer ge en god bild av vad det inneb&auml;r att strukturera applikationer i JavaScript, och vilka de b&auml;sta verktygen och metoderna &auml;r!</p>


				<h2>
					Kursplan
				</h2>
				<p>
Den officiella kursplanen hittar du <a href="https://prod.kursinfo.lnu.se/utbildning/GenerateDocument.ashx?code=2Dv407&revision=1&documenttype=pdf&templatetype=coursesyllabus&lang=sv">här</a>.
				</p>
				<h2 id="planering">
					Veckoplanering
				</h2>
				<p>
Nedan ser du en en översikt över tidsperspektiven för <a href="#steg">kursens steg</a>.
				</p>
<table>
	<thead>
		<tr>
			<th>Kurssteg</th><th>Datum</th>
		</tr>
	</thead>
	<tbody>
		<tr><td><a href="#intro">Steg 0 - Intro</a></td><td>Vecka 4 (23-29 jan)</td></tr>
		<tr><td><a href="#plan">Steg 1 - Planering</a></td><td>Vecka 5-6 (30 jan - 12 feb)</td></tr>
		<tr><td><a href="#impl">Steg 2 - Implementering</a></td><td>Vecka 7-9 (13 feb- 4 mars)</td></tr>
		<tr><td><a href="#kollab">Steg 3 - Kollaborering</a></td><td>Vecka 10-11 (5-18 mars)</td></tr>
		<tr><td><a href="#deepdive">Steg 4 - Fördjupning</a></td><td>Vecka 12 (19-25 mars)</td></tr>
		<tr><td><a href="#eval">Steg 5 - Utvärdering</a></td><td>Vecka 13 (26 mars - 1 april)</td></tr>
	</tbody>
</table>
				<h2 id="diskus">Forum</h2>
<img src="img/yammer.jpg" class="logo" /> 
				<p>
Yammer bla bla yada.
				</p>
				<h2 id="litt">
					Litteratur
				</h2>
<p></p>
				<h3>Böcker</h3>
				<img class='book' src="img/book_javascript_patterns.jpg"/>
				<img class='book' src="img/book_javascript_web_applications.jpg"/>
				<p>
Kursen har ingen officiell kurslitteratur, men dessa två böcker kommer starkt rekommenderade:
				</p>
				<ul>
					<li><a href="http://shop.oreilly.com/product/9780596806767.do">JavaScript Patterns</a>: I denna bok tar Stoyan Stefanov upp programmeringsmönster i JavaScript, både i smått och i stort. Den har ett ganska abstrakt upplägg, men innehåller också praktiska exempel. En väldigt bra bok för att komma in i "rätt sätt att tänka" vad gäller strukturering av JavaScriptkod.</li>
					<li><a href="http://shop.oreilly.com/product/0636920018421.do">JavaScript Web Applications</a>: En betydligt mer praktisk bok, där Alex MacCaw diskuterar byggande av JavaScriptapplikationer ur olika perspektiv. Väl lämpad som litteratur till denna kurs, då den också har ett kapitel om <a href="#backbone">Backbone</a>.</li>
				</ul>
				<h3>Online-resurser</h3>
				<p>Här är ett urval av generella online-resurser som kan tjäna dig väl i kursen:</p>
				<ul>
					<li><a href="https://developer.mozilla.org/en/JavaScript">Mozilla Developer Network</a> har utmärkta referenser och guider. Används med fördel när du behöver kolla upp någon bortglömd syntax! Observera att allt nyttjande av W3Schools för samma syfte är direkt förbjudet, se <a href="http://w3fools.com">W3Fools</a> för mer info.</li>
					<li><a href="http://addyosmani.com/resources/essentialjsdesignpatterns/book/">Essential JavaScript Design Patterns</a> - En onlinebok av Addy Osmani, som likt Stefanovs bok ämnar hjälpa läsaren att strukturera JavaScriptkod. Starkt rekommenderad läsning!</li>
					<li><a href="http://bonsaiden.github.com/JavaScript-Garden/">JavaScript Garden</a> - Denna site är inte en JavaScript-tutorial, utan siktar in sig på att förklara just de delar som skiljer sig from mer traditionella programmeringsspråk.</li>
					<li><a href="http://ejohn.org/apps/learn/">Learning Advanced jQuery</a> - En liten interaktiv onlinekurs av jQuerys skapare John Resig, som (precis som JavaScript Garden) förklarar JavaScripts mer avancerade delar. Att genomgå denna kurs och kommentera resan är något som vi bedömde är så värdefullt att vi gjort det till en obligatorisk del av <a href="#intro">kursens första steg</a>.
					<li><a href="http://eloquentjavascript.net/">Eloquent JavaScript</a> - En fullständig läroresurs för JavaScript. Täcker även grundläggande programmeringsparadigmer, men är man beredd att plocka russinen ur kakan så innehåller boken också goda råd på högre nivå.</li>
				</ul>
				<h2>Lärare</h2>
<img src="img/johan.jpg" class="ppl"/>
<img src="img/david.jpg" class="ppl"/>
				<ul>
					<li><strong>David Waller</strong>: Undervisande lärare, handledare (skype: litendavid)</li>
					<li><strong>Johan Leitet</strong>: Examinator och kursansvarig (skype: hiktstjo)</li>
				</ul>
				<h2 id="students">Deltagare</h2>
				<p>Efter att registreringarna är genomförda och <a href="#intro">det första kurssteget</a> avklarat, så kommer här finnas en lista över kursdeltagarna med länk till deras respektive bloggar och repositorier.</p>
				<h2>Arkiv</h2>
				<p>Tidigare års kurswebbar hittar du <a href="http://voyager.lnu.se/tekinet/kurser/dtt/2DV407/">här</a>. Ha dock i åtanke att uppläggen där skiljer sig något åt från årets version.</p>
				<h1 id="steg">
					Steg
				</h1>
				<p>
Kursgenomförandet är uppdelat i ett antal <strong>steg</strong>. Varje steg innebär...
</p>
<ul>
	<li>en publicering av (minst) ett <strong>blogginlägg</strong>. Dokumentationen av din arbetsgång är en viktig del i betygsunderlaget, så ge inte all kärlek till kodandet utan lägg tid på skrivandet också!</li>
	<li>(minst) ett <strong>handledningssamtal</strong> med lärare. Då detta är en fördjupningskurs kommer ni arbeta ganska självständigt, men förhoppningsvis kan det ändå vara en resurs för er att stämma av med oss.</li>
</ul>
<p>
För en översikt över de olika stegens deadlines, se kursens <a href="#planering">planering</a>.
				</p>
				<p>Klicka på respektive flik för att se en detaljerad redogörelse över exakt vad som förväntas på de olika stegen.</p>
				<h2 id="intro">
					0: Intro
				</h2>
				<div class="date">Vecka 4<span>23-29 jan</span></div>
				<p>
Hello World! I detta första steg ska du kratta manegen för kursen genom att...
<ol>
	<li><strong>läsa igenom materialet</strong> här på kurswebben. Det är viktigt att du snabbt får en översikt över hur arbetsgången kommer se ut!</li>
	<li><strong>installera Git</strong>, <strong>registrera dig</strong> på Github och <strong>skapa ett repositorium</strong> för kursprojektet. Se <a href="#git">Githubsektionen</a> för mer info.</li>
	<li><strong>genomgå</strong> John Resigs <a href="http://ejohn.org/apps/learn/">Learning Advanced jQuery</a>, och eventuellt uppdatera/komplettera med kunskaper för att förstå hela resan! En utmärkt resurs för att bättra på / borsta av kunskaperna om JavaScripts mer esoteriska delar är <a href="http://bonsaiden.github.com/JavaScript-Garden/">JavaScript Garden</a>.</li>
	<li>sätta upp en <strong>blogg</strong> där du sedermera ska redogöra för dina kursrelaterade förehavanden. Att använda en befintlig blogg är givetvis helt ok, använd i så fall gärna en unik tagg (typ "RIA") för kursens inlägg.</li>
	<li>
		skriva ett <strong>första blogginlägg</strong>. Det ska innehålla...
		<ul>
			<li>en kort <strong>presentation</strong> av dig själv, främst ur frontend-perspektiv. Hur ser din relation till JavaScript ut? Hur mycket använder du det i det dagliga värvet?</li>
			<li><strong>förväntningar &amp; förhoppningar</strong> på kursen.</li>
			<li><strong>reflektioner</strong> runt Resigs Learn app. Hur nära ytan låg de kunskaperna för dig?</li>
			<li>en <strong>länk</strong> till ditt Github-repo.</li>
		</ul>
	</li>
	<li><strong>fixa konto</strong> på <a href="#diskus">Yammer</a>.</li>
	<li>Lägga ett <strong>meddelande</strong> i presentationstråden på Yammer, där ni också skickar med länk till ert första blogginlägg. När du gjort det så kommer en länk till din blogg att läggas till i <a href="#students">deltagarlistan</a>.</li>
	<li>Fånga läraren för ett <strong>första Skypesamtal</strong>.</li>
</ol>
</p>

				</p>
				<h2 id="plan">
					1: Planering
				</h2>
				<div class="date">Vecka 5-6<span>30 jan - 12 feb</span></div>

				<p>Med manegen krattad s&aring; &auml;r det dags att p&aring;b&ouml;rja projektdelen av kursen! Den kommer genomf&ouml;ras i ett antal olika delsteg, detaljerade nedan. Redovisa g&auml;rna dessa med <strong>separata blogginl&auml;gg</strong> för varje del!</p>
				<p>&Auml;ven om m&aring;nga s&auml;kert vill speeda igenom denna del f&ouml;r att komma fram till kodandet - vi &auml;r ju trots allt programmerare - s&aring; uppmanas ni att <strong>ta er tid</strong> att verkligen fundera &ouml;ver de olika momenten i planeringen. Att strukturera JavaScriptapplikationer &auml;r lurigt, och det &auml;r framf&ouml;r allt dessa f&auml;rdigheter som kursen som helhet vill tillhandah&aring;lla!</p>
				<h3>Projektval</h3>
				<p>F&ouml;rst och fr&auml;mst m&aring;ste du best&auml;mma <strong>vad</strong> du skall bygga! F&ouml;ljande punkter kan vara bra att t&auml;nka p&aring;:</p>
				<ul>
				<li>F&ouml;r att uppn&aring; l&auml;mplig komplexitet s&aring; m&aring;ste din applikation p&aring; n&aring;got s&auml;tt <strong>hantera data </strong>fr&aring;n anv&auml;ndaren.</li>
				<li>I n&aring;gon mening m&aring;ste denna data vara <strong>varaktig&nbsp;&ouml;ver sessionen</strong>. En applikation som exempelvis endast omvandlar metriska l&auml;ngder till imperial units &auml;r inte ok, d&aring; all funktionalitet &auml;r &ouml;gonblicklig. D&auml;remot om samma app har en liten sidebar med dina senaste s&ouml;kningar s&aring; uppfyller den detta krav.&nbsp;</li>
				<li>Det &auml;r ocks&aring; &ouml;nskv&auml;rt att din applikation <strong>sparar data mellan sessioner</strong>&nbsp;(dock inget absolut m&aring;ste p&aring; G-niv&aring;). Detta beh&ouml;ver inte inneb&auml;ra krav p&aring; ett backend, utan det &auml;r helt ok att anv&auml;nda klientsidel&ouml;sningar s&aring;som localStorage.</li>
				<li>Det faller sig d&aring; ganska naturligt att appen har n&aring;gon sorts <strong>CRUD</strong>; det vill s&auml;ga att anv&auml;ndaren kan skapa, &auml;ndra och ta bort bland objekten.</li>
				<li>Vi ser ocks&aring; helst att din applikation har <strong>mer &auml;n ett sorts objekt</strong>. Det &auml;r f&ouml;rst n&auml;r olika "klasser" ska interagera med varandra som kraven p&aring; en solid kodorganisering blir tillr&auml;ckligt givande! En kalenderapp d&auml;r man bara kan l&auml;gga in h&auml;ndelser blir d&auml;rmed lite f&ouml;r simpel, men om man l&auml;gger till taggar i mixen, eller har olika typer av h&auml;ndelser, s&aring; uppfyller man kravet!</li>
				<li>I kursen &auml;r det fokus p&aring; sj&auml;lva byggprocessen, s&aring; resultatet i sig &auml;r inte det som prim&auml;rt &auml;r betygs&auml;ttande. Det &auml;r d&auml;rf&ouml;r viktigt att applikationen <strong>inte har alltf&ouml;r stor omfattning</strong>! P&aring; de tre implementationsveckorna hinner du inte utr&auml;tta alltf&ouml;r stora d&aring;d, men d&auml;remot f&ouml;rhoppningsvis bygga en liten produkt f&ouml;r att testa dina RIA-byggarf&auml;rdigheter. H&aring;ll d&auml;rf&ouml;r nere ambitionsniv&aring;n vad g&auml;ller bredd och funktionalitet i din app!</li>
				</ul>
				<h3>Kravspecifikation</h3>
				<p>Nu n&auml;r du vet vad du skall bygga s&aring; &auml;r det dags att g&ouml;ra en <strong>specifikation</strong> av vad detta inneb&auml;r mer i detalj. Detta beh&ouml;ver inte betyda en fullst&auml;ndig kartl&auml;ggning s&aring;som i OOAD-kursen; huvudkravet &auml;r att n&auml;r man efter att ha l&auml;st din specifikation vet mer eller mindre exakt vad din applikation skall kunna &aring;stadkomma.&nbsp;</p>
				<p>Vad skall d&aring; kravspecifikationen best&aring; av? H&auml;r f&ouml;ljer n&aring;gra f&ouml;rslag:</p>
				<ul>
				<li>Inled g&auml;rna med en simpel&nbsp;<strong>lista &ouml;ver funktionalitet</strong> som du vill ha med.</li>
				<li>Denna kan sedan f&ouml;rtydligas genom att du skissar en <strong>mockup</strong> &ouml;ver de olika vyer som din app skall best&aring; av.</li>
				<li>Du kan sedan konkretisera ytterligare via <strong>use cases</strong>, d&auml;r kraven p&aring; applikationen blir tydligare.</li>
				</ul>
				<p>Gr&auml;nsen mellan dessa olika kravspecifikationsingredienser &auml;r ofta ganska flytande. Du &auml;r som sagt fri att utforma specifikationen helt efter eget behav, f&ouml;rutsatt att den utg&ouml;r en n&aring;gorlunda l&auml;ttillg&auml;nglig beskrivning &ouml;ver all funktionalitet i din applikation.</p>
				<h3>Objekt och data</h3>
				<p>H&auml;rn&auml;st b&ouml;r du <strong>specifiera de ing&aring;ende objekten&nbsp;</strong>i applikationen, b&aring;de vad g&auml;ller egenskaper och faktisk datarepresantion. Det inneb&auml;r...</p>
				<ul>
				<li>Ett <strong>klassdiagram </strong>(eller motsvarande)&nbsp;d&auml;r du listar de olika objekten och deras egenskaper, metoder och inb&ouml;rdes relationer.</li>
				<li>En sketch &ouml;ver de olika objektens <strong>JSON-format</strong>, dvs exakt hur datan skall representeras. Eftersom JSON är JavaScriptkod så kan man med fördel skissa just med kod, vilket skulle kunna se ut så här:</li>
				</ul>
<pre class="brush: js">
Address = {
	street: "Stävgatan 3E", // string
	zip: 12345, // 5-digit integer
	city: "Ystad" // string
}

User = {
	name: "David Waller", // string with full name
	age: 32, // integer
	adress: {} // Adress object
}
</pre>
				<p>Detta f&ouml;r att du h&auml;danefter beh&ouml;ver ha en tydlig id&eacute; om exakt hur datan ser ut som skickas till och fr&aring;n din applikations olika funktioner.</p>
				<h3>Moduler och funktioner</h3>
				<p>Nu n&auml;r du vet vilken funktionalitet din applikation str&auml;var efter och hur de ing&aring;ende dataobjekten ser ut s&aring; kan du b&ouml;rja <strong>identifiera de funktioner</strong> som din applikation beh&ouml;ver. En v&auml;ldesignad funktion har ett enda ansvarsomr&aring;de - vi vill inte se monsterfunktioner som har fyra-fem olika uppdrag p&aring; sina axlar! F&ouml;r varje funktion, specifiera vilka argument den tar emot, hur den bearbetar den datan, och vad den returnerar. Precis som med objekten så kan du med fördel göra detta via koddefinitioner. Exempelt nedan har kommentarer av JSDoc-typ, men det funkar givetvis lika bra med fritext.</p>
<pre class="brush: js">
/**
  * @param addr An Address object
  * @return bool True if all props are ok
  */
function validateAddress(addr){
	// check if all properties are valid 
}

/**
  * @param users An array of User objects
  * @name name A name to match against
  * @return User* An array of all matching users (empty array if no matches)
  */
function findUserByName(users,name){
	// loop through users and add matches to result
}
</pre>
				<p>N&auml;r det g&auml;ller <strong>instansfunktioner</strong>&nbsp;(det vill s&auml;ga funktioner som opererar p&aring; ett enskilt objekt) s&aring; finns det en f&ouml;rdel med att g&ouml;ra dessa som <strong>statiska</strong> funktioner ist&auml;llet - vi kan nu spara ned alla v&aring;ra objekt direkt i en JSON-struktur i databasen, utan att oroa oss f&ouml;r att metoder g&aring;r f&ouml;rlorade.</p>
				<p>F&ouml;r en extra utmaning, f&ouml;rs&ouml;k h&aring;lla funktionerna <strong>fullst&auml;ndigt portabla</strong> genom att designa dem s&aring; att de endast hanterar sina argument, och inte r&ouml;r n&aring;gra andra variabler eller metoder som finns i samma scope. Hur g&ouml;r man d&aring; om en funktion beh&ouml;ver anv&auml;nda en annan funktion? Man skickar in &auml;ven den andra funktionen som ett argument! Detta m&ouml;nster kallas Dependency Injection. En stor f&ouml;rdel med denna approach &auml;r att de individuella funktionerna blir mycket l&auml;ttare att testa, ifall du v&auml;ljer att arbeta med <a href="#test">unit testing</a>.</p>
				<p>N&auml;r du v&auml;l har listat de funktioner du beh&ouml;ver s&aring; &auml;r det dags att sortera dessa i <strong>moduler</strong>. Hur kan funktionerna grupperas? F&ouml;rs&ouml;k hitta gemensamma teman och dela upp funktionerna i enlighet med dessa. Varje s&aring;dan grupp blir sedan en modul, vilket i praktiken inneb&auml;r ett JavaScriptobjekt (Singleton). Även dessa kan du med fördel skissa i kod som tidigare:</p>
<pre class="brush: js">
// User module, containing all User-related functions
User = {
	validateAddress: function(addr){...},
	findUserByName: function(users,name){...}
}
</pre>


				<h3>Kodorganisering</h3>
				<p>Med funktionerna och modulerna kartlagda s&aring; kan vi zooma ut &auml;nnu ett steg och fundera &ouml;ver <strong>var den h&auml;r koden faktiskt skall bo</strong>. En vanlig approach &auml;r att <strong>varje modul blir en fil</strong>. Varje fil definierar en Singleton, som har sina funktioner som metoder.</p>
				<p>Det som kr&auml;ver ytterligare lite fundering &auml;r <strong>hur dessa filer skall laddas in</strong> i din applikation. Det vanligaste &auml;r att man direkt l&auml;nkar in dem via script-taggar, men det kr&auml;ver att de olika modulerna vet hur ditt namespace ser ut och var de ska "stoppa in sig sj&auml;lva".&nbsp;</p>
				<p>En b&auml;ttre approach &auml;r att <strong>h&aring;lla varje modul ovetandes om den st&ouml;rre kontexten</strong>, och ist&auml;llet l&aring;ta dem returnera ett objekt. Den kontext som importerade modulen blir sedan ansvarig f&ouml;r att g&ouml;ra n&aring;got vettigt av det objektet. Precis s&aring; fungerar det i Node, men i "ren JavaScript" finns ingen direkt motsvarighet &auml;nnu. Olika f&ouml;rslag finns dock till n&auml;sta version.&nbsp;</p>
				<p>Under tiden finns det dock <strong>ett antal olika bibliotek som l&ouml;ser problemet</strong>. En alldeles utm&auml;rkt &ouml;versikt ges i <a href="http://addyosmani.com/writing-modular-js/">denna text</a> av Addy Osmani, som &auml;r mer eller mindre obligatorisk l&auml;sning p&aring; omr&aring;det.</p>
				<p>Efter detta steg s&aring; har du en fullst&auml;ndig karta &ouml;ver dina olika metoder, i vilka moduler de bor, och hur dessa moduler skall importeras. Med andra ord &auml;r planeringen avklarad, och det &auml;r dags att (&auml;ntligen?) b&ouml;rja koda p&aring; riktigt!</p>


				<h2 id="impl">2: Implementering</h2>
				<div class="date">Vecka 7-9<span>13 feb - 4 mars</span></div>
				<p>&Auml;ntligen dags att l&auml;gga ifr&aring;n sig pennan och ladda tangentborden!</p>
				<h3>Golvgjutning</h3>
				<p>F&ouml;rmodligen &auml;r det mesta av golvet redan lagt. Du har ett repositorium p&aring; Git, och i planeringssteget skapade du n&aring;gon form av skiss &ouml;ver applikationens best&aring;ndsdelar. Men f&ouml;r att komma ig&aring;ng:</p>
				<ul>
				<li>B&ouml;rja med att <strong>skapa de filer</strong> som applikationen skall inneh&aring;lla. Om du gjorde din planering i kodskisser s&aring; kan dessa med v&auml;ldigt lite editering tj&auml;na som utg&aring;ngspunkt f&ouml;r dessa!</li>
				<li>L&auml;gg sedan in de <strong>yttre bibliotek</strong> du t&auml;nker anv&auml;nda, och kolla att delarna funkar. Framf&ouml;r allt kommer du f&ouml;rmodligen beh&ouml;va l&auml;gga lite tid p&aring; <a href="#backbone">Backbone</a>.</li>
				<li>Om du har <strong>ytterligare beroenden</strong> (kanske <a href="#node">Node</a> eller en <a href="#couchdb">CouchDB-databas</a>, alternativ hosting etc), f&aring; &auml;ven dessa up and running!</li>
				</ul>
				<h3>Programmering</h3>
				<p>Sedan &auml;r det &auml;ntligen dags att <strong>imlementera funktionaliteten</strong>! Arbeta utifr&aring;n din planering, och f&ouml;rs&ouml;k sortera bitarna s&aring; att du b&ouml;rjar med de som inte har n&aring;gra beroenden, och sedan arbetar dig upp&aring;t. H&auml;r &auml;r n&aring;gra h&aring;llpunkter att t&auml;nka p&aring;:</p>
				<ul>
				<li>N&auml;r du arbetar s&aring; ska du <strong>l&ouml;pande pusha din kod</strong> till <a href="#git">GitHub</a>. Om du valt att f&ouml;rdjupa dig i Git-anv&auml;ndning s&aring; kan du med f&ouml;rdel ocks&aring; anv&auml;nda <strong>taggar</strong> f&ouml;r att markera milstolpar, och arbeta i <strong>olika branches </strong>som du sedan mergar med huvudbranchen.</li>
				<li>Arbeta inte i ett vacuum, utan utnyttja <strong>handledning med l&auml;rare</strong> och <strong>diskussion med kurskamrater</strong> p&aring; <a href="#yammer">forumet</a>!</li>
				<li>Hela implementeringssteget skall redovisas p&aring; bloggen, men det kan vara l&auml;mpligt att <strong>delredovisa med enskilda blogginl&auml;gg</strong>, allteftersom du f&auml;rdigst&auml;ller delar eller r&aring;kar ut f&ouml;r &auml;ventyr.</li>
				<li>Om du v&aring;gat dig p&aring; att arbeta med <a href="#test">Unit Testing</a> s&aring; ska &auml;ven testen l&ouml;pande pushas till repositoriet. Anv&auml;nder du Jasmine eller ett annat browser-baserat bibliotek, s&aring; se g&auml;rna till att testsidan finns direkt tillg&auml;nglig p&aring; ditt gh-pages-konto!</li>
				<li>Gl&ouml;m inte heller bort att du i slut&auml;ndan kommer vara tvungen att tillhandah&aring;lla en <a href="#dokumentation">dokumentation</a> &ouml;ver din applikations kod! Det b&auml;sta &auml;r att <strong>l&ouml;pande kommentera din kod</strong> redan h&auml;r under impementationsfasen, s&aring; att du inte beh&ouml;ver g&ouml;ra allt jobb i efterhand.</li>
				</ul>
				<h3>Anv&auml;ndargr&auml;nssnitt</h3>
				<p>Avslutningsvis, med funktionaliteten p&aring; plats, &auml;r det dags att <strong>ge anv&auml;ndargr&auml;nssnittet lite k&auml;rlek</strong>.&nbsp;Du beh&ouml;ver inte utr&auml;tta n&aring;gra stord&aring;d h&auml;r, d&aring; kursens fokus ligger ganska l&aring;ngt ifr&aring;n artistisk f&auml;rdighet, men n&aring;got f&auml;rglager kanske inte skadar!</p>
				<p>Vi vill ocks&aring; att du funderar &ouml;ver <strong>anv&auml;ndarv&auml;nlighet</strong> och <strong>tillg&auml;nglighet</strong>. &Auml;ven om din applikation &auml;r ganska liten, s&aring; finns det f&ouml;rv&aring;nansv&auml;rt mycket h&auml;nsyn att ta under dessa rubriker.&nbsp;</p>
				<p>Mer information och inspiration finns p&aring; <a href="http://voyager.lnu.se/tekinet/kurser/dtt/2DV407/index.php?sida=html%2F2011%2Fsteg%2Fsteg5">motsvarande sida p&aring; f&ouml;rra &aring;rets kurswebb</a>.</p>
				<h3>Avslutning</h3>
				<p>Nu har du till slut en fungerande RIA, och det &auml;r dags att...</p>
				<ul>
				<li>l&aring;ta omv&auml;rlden f&aring; veta! Publicera ett <strong>blogginl&auml;gg</strong>, och annonsera p&aring; <a href="#yammer">Yammer</a>.</li>
				<li>se till att <a href="#dokumentation">dokumentationen</a> &auml;r p&aring; plats - du &auml;r inte klar f&ouml;rr&auml;n s&aring; har skett!</li>
				<li>f&aring;nga l&auml;rare f&ouml;r ett <strong>projektavslutande samtal</strong> och utv&auml;rdering.</li>
				</ul>

				<h2 id="kollab">3: Kollaborering</h2>
				<div class="date">Vecka 10-11<span>5-18 mars</span></div>
				<p>Pull request! Woo!</p>
				<h2 id="deepdive">4: Fördjupning</h2>
				<div class="date">Vecka 12<span>19-25 mars</span></div>
				<p>slk asöld kasd </p>
				<h2 id="eval">5: Utvärdering</h2>
				<div class="date">Vecka 13<span>26 mars - 1 april</span></div>
				<p>Kursen, egna insatsen, återknyt till första inlägget &amp; relationen till JavaScript.</p>
				<h1 id="aspekter">
					Aspekter
				</h1>
				<p>
Kursen tar upp olika bla bla bla. Frivilliga och obligatoriska. I <a href="#plan">planeringssteget</a> ska du välja vilka av dessa du vill använda i kursen.
				</p>
				<p>
En av dem skall dessutom senare bli fokus för din <a href="#deepdive">fördjupning</a>.
				</p>
				<h2>Obligatoriska</h2>
				<p>Dessa koncept är obligatoriska för samtliga.</p>
				<h3 id="git">Github</h3>
<img class="logo" src="img/github-logo.png" />
<p>Koden till applikationen du kommer bygga ska versionshanteras med hjälp av Git. Den i JavaScriptvärlden vanligaste providern av Gitrepositorier online är Github, som också är den lösning vi använder i kursen.</p>
<p>Tjuvkika gärna på <a href="http://voyager.lnu.se/tekinet/kurser/dtt/2DV407/index.php?sida=html%2F2011%2Fresurser%2Fgit">denna sida</a> i förra årets kurswebb, där flertalet tutorials och resurser finns länkade.</p>
<p>Redan i <a href="#intro">första kurssteget</a> skall du <strong>installera Git</strong> (om du inte redan har det), <strong>registrera dig</strong> på Github, och <strong>skapa ett repositorium</strong> för din kursapp.</p>
<p>Därefter kommer du löpande att <strong>committa</strong> dina ändringar lokalt för att sedan <strong>pusha</strong> upp din kod till Github. Om du vill fördjupa dig lite mer i Gitanvändning så kanske du också kommer använda <strong>taggar</strong> för att markera milstolpar i projektet, och <strong>branches</strong> för att utveckla specifik funktionalitet som sedan <strong>mergas</strong> tillbaka in i huvudbranchen ("master").</p>
<p>I kursens <a href="#kollab">fjärde steg</a>, efter att applikationerna är färdigställda, skall ni få testa på Githubs verkliga styrka; möjlighet till <strong>kollaboration</strong>! Här är tanken att ni skall sätta er in i en kurskamrats projekt, <strong>forka</strong> dennes repositorium, göra en liten vidareutveckling/bugfix, och sedan skicka en <strong>pull request</strong>. På samma sätt kommer du själv också få ta ställning till pull requests från kurskamrater, och <strong>merga</strong> in dessa i din kod. Om du tycker ändringen håller måttet, vill säga...</p>
<p>Målet med Githubanvändningen i kursen är först och främst att ni skall bli någorlunda <strong>vana användare</strong> av det, då Github har blivit mer eller mindre en standard vid större JavaScriptprojekt. Men framför allt hoppas vi också på att ni ser nyttan av det - både vad gäller den smidiga <strong>versionshanteringen</strong>, den enkla <strong>molnbackupen</strong>, och <strong>kollaborationsmöjligheterna</strong>.</p>
<p>Om Github ger dig mersmak så rekommenderas du att göra din <a href="#deepdive">fördjupning</a> om Github. Här har du en ypperlig chans att grotta ned dig ytterligare i detaljerna!</p>

				<h3 id="backbone">Backbone</h3>
<img class="logo" src="img/backbone.png" />
<p>Som grund till applikationen kommer vi använda oss av det lilla ramverket <a href="http://www.backbonejs.org">Backbone</a>. Läs igenom det här avsnittet för att se vad Backbone är, och vad detta innebär för ditt applikationsbyggande!
</p>
<h4>Varför Backbone?</h4>
<p>I tidigare iterationer av kursen har studenterna fritt fått välja ramverk, men i år är just Backbone obligatoriskt. Det finns flera anledningar till att vi vill att ni ska smaka på just detta ramverk:</p>
<ul>
	<li>Backbone har snabbt uppnått en <strong>stor popularitet</strong>, och är därför något man förväntas känna till.</li>
	<li>Det är ett ganska <strong>litet</strong> ramverk, och därmed fullt möjligt att bemästra inom ramen för kursen. Den ominifierade, kommenterade källkoden är bara på lite drygt 1000 rader kod.</li>
	<li>Backbone låter dig <strong>fritt organisera din kod</strong>, vilket är viktigt för kursen - just kodorganisation är något som är extra lurigt vid byggandet av RIA i JavaScript, och därmed något vi vill fokusera på i kursen.</li>
	<li>Och slutligen så är Backbone <strong>riktigt bra</strong>. :) Den erbjuder just en ryggrad för webappar, genom att tillhandahålla verktyg för kommunikation, datahantering och förmåga att reagera på dataförändringar. Detta är något som alla webbappar behöver, oavsett ras, kön &amp; religion.</li>
</ul>

<h4>Resurser</h4>
<p>Här listas ett antal resurser för att hjälpa dig komma igång med Backbone!</p>
<ul>
	<li>Den <a href="http://backbonejs.org">Officiella hemsidan</a> är alldeles utmärkt, och ger snabbt både en bild av vad Backbone är och hur API:t används.</li>
	<li>Där finner du också den <a href="http://backbonejs.org/docs/backbone.html">dokumenterade källkoden</a>, som är rekommenderad läsning. Backbone är som sagt inte särskilt omfattande, så att ögna igenom källkoden går ganska snabbt!</li>
	<li>Missa inte Backbones officiella <a href="https://github.com/documentcloud/backbone/wiki">Wiki</a>, som är full med alldeles utmärkta länkar och resurser!</li>
	<li>Onlineboken <a href="https://github.com/addyosmani/backbone-fundamentals">Backbone Fundamentals</a> av Addy Osmani är en ypperlig utgångspunkt. Den innehåller också en hel del diskussion runt organisering av koden.</li>
	<li>Den för kursen rekommenderade boken JavaScript Web Applications har ett bra kapitel dedikerat till Backbone, dessutom i kontexten just av byggandet av Web Apps. Därmed utmärkt läsning för att komma igång med Backbone i kursen! Se <a href="#litt">litteratursidan</a> för mer info.</li>
	<li>Duktiga screencastföretaget <a href="http://peepcode.com">Peepcode</a> har gjort en trilogi videor om Backbone som är riktigt bra. De första två hänger ihop och täcker tillsammans grunderna väldigt väl, medan den tredje är lite mer fristående och fokuserar på persistence. De kostar $12 styck.</li>
	<li><a href="http://recipeswithbackbone.com/">Recipes with Backbone</a> är en onlinebok som tar upp mer avancerade mönster &amp; koncept i Backbone. Prislappen på $24 är kanske lite avskräckande, men boken är riktigt bra! Märk väl dock att den förutsätter att man redan är bekant med Backbones grunder.</li>
</ul>


<h4>Insticksprogram</h4>
<p>Som alla ramverk med självrespekt så är Backbone gjort för att <strong>enkelt kunna utökas</strong> via plugins. I fallet med Backbone så är detta extra viktigt, eftersom ramverket bara erbjuder grundläggande funktionalitet, och frestelsen för många utvecklare att bygga ut med mer specifik funktionalitet kommer därmed vara stor.</p>
<p>Här nedan följer en <strong>lista</strong> på några instick som skulle kunna vara intressanta för kursappen. Det finns <strong>inget tvång</strong> på att använda några plugins i kursen. Om du funderar på att göra din <a href="#deepdive">fördjupning</a> om Backbone så rekommenderas du att använda åtminstone något plugin, eftersom det är ett alldeles utmärkt sätt att lära känna ramverket bättre.</p>
<ul>
	<li><a href="http://documentcloud.github.com/backbone/docs/backbone-localstorage.html">Localstorage</a> - En plugin som enkelt låter dig spara data via HTML5 localstorage. Rekommenderas varmt för att hantera datan i appen!</li>
	<li><a href="https://github.com/PaulUithol/Backbone-relational">Relational</a> - Denna plugin låter dig definiera relationer mellan dina Models.</li>
	<li><a href="https://github.com/derickbailey/backbone.modelbinding">Model binding</a> - smidiga kopplingar mellan modelldata och view, som fixar automagiska uppdateringar.</li>
	
</ul>


	<h3 id="dokumentation">Dokumentation</h3>
<p>Ett obligatoriskt moment i projektbyggandet är att <strong>skapa en dokumentation</strong> över din kod i html-form, så att den enkelt kan länkas till och hostas på Github pages.</p>
<p>Du är fri att skapa den här dokumentationen precis som du vill, så att 'manuellt' tillhandahålla den är helt i sin ordning. Det uppmuntras dock att du istället genererar koden via något av de verktyg som är populära i branchen. Här är några exempel på sådana:</p>
<ul>
<li><a href="http://code.google.com/p/jsdoc-toolkit/">JSDoc Toolkit</a>, en javabaserad genererare som skapar en rik html-struktur.</li>
<li><a href="http://jashkenas.github.com/docco/">Docco</a>, en enklare variant med mer övergripande kommentarer. Basversionen är Node-baserad, men där finns också portningar till de flesta andra plattformar.</li>
<li><a href="http://developer.yahoo.com/yui/yuidoc/">YUI Doc</a>, en del av YUI framework. Kan användas även till icke-YUI-kod.</li>
<li><a href="http://www.naturaldocs.org/">Natural Docs</a> har inte JavaScript som huvudfokus, men producerar fullt tillräcklig dokumentation.</li>
</ul>
<p>
Även om dokumentationen blir fullständig först när din applikation är klar, så rekommenderas du att du redan i inledningen väljer vilken dokumentationslösning du vill använda. Då kan du löpande kommentera koden med rätt syntax, istället för att allra sist behöva gå igenom hela din kod och lägga in kommentarerna.
</p>
				<h2>Frivilliga</h2>
				<p>Frivillig fördjupning yada yada etc. högre betyg?</p>
				<h3>CoffeeScript</h3>
<img class="logo" src="img/coffeescript_logo.png" />
<p>En av de hetaste trenderna i JavaScriptvärlden senaste året har varit <a href="http://coffeescript.org">CoffeeScript</a>, som är en 'förfinad dialekt' av JavaScript. Enkelt förklarat så skriver man sin kod i CoffeeScript, som sedan kompileras om till JavaScript som körs 'som vanligt' i webbsidan (eller vad det nu är man programmerar).</p>
<p>Den officiella hemsidan länkad ovan är väldigt bra, du hittar också en förklaring och resurssamling <a href="http://blog.krawaller.se/coffeescript-overview-and-resource-inventory">här</a>.</p>
<p>Notera att om du använder CoffeeScript i kursen så bör du committa <strong>både</strong>CoffeeScript-filerna och de genererade JavaScript-filerna till repositoriet!</p>
				<h3 id="node">Node.js</h3>
<img class="logo" src="img/node.png" />
				<p>
Node är ett 'JavaScript runtime environment', främst använt för att skriva Serverlösningar i JavaScript. De sista två åren har Node fått ett enormt genomslag, och spridningen bara ökar. Inledningsvis funderade vi på att ha med Node som en obligatorisk del av kursen, då den är en given plattform för en JavaScript-RIA idag. I slutändan valde vi dock att endast ha Node som en frivillig fördjupning. Om du är nyfiken, eller siktar på att arbeta professionellt med JavaScript, så rekommenderas du att kolla in Node!
				</p>
<p>Här är ett axplock av de mest användbara online-resurserna:</p>
				<ul>
					<li><a href="http://nodejs.org/">Node.js</a> officiella hemsida</a> är den naturliga utgångspunkten. Har både dokumentation och tutorials.</li>
					<li>Communityns <a href="https://github.com/joyent/node/wiki">Node Wiki</a> är en väldigt bra resurssamling.</li>
					<li><a href="http://www.nodecloud.org/">NodeCloud</a> är en genererad lista över de Node-resurser som är populärast just nu. Ett supersmidigt sätt att snabbt få koll på läget!</li>
					<li><a href="http://nodebeginner.org/">Node Beginner</a> är en oerhört välskriven e-bok om att koda sin första Node-app. Boken kan läsas gratis online, och epub-version finns att köpa.</li>
				</ul>
				<p>
Om du väljer att använda Node i kursen så kan du inte ha Github Pages som publiceringsplattform för din app, eftersom denna bara hanterar rena webbappar. I NodeCloud-listan ovan finns dock ett antal gratis Node-hosting länkade.
				</p>
<!--
				<h3 id="c9">Cloud9</h3>
<img class="logo" src="img/cloud9ide.png" />
				<p>
moo moo <a href="http://c9.io/">hemsida</a>
				</p>
-->
				<h3>NoSQL</h3>

<p>bla bla ny paradigm bla bla, bort från SQL och tables, yidder yidder.</p>
<p>måste ej använda woo</p>
<p>Två olika:</p>
<h4 id="couchdb">CouchDB</h4>
<img class="logo" src="img/couchdb-logo.png"/>
<p><a href="http://couchdb.apache.org/">CouchDB</a> är ett projekt som sorterar under <a href="http://www.apache.org/">Apache Software Foundation</a>. Ett utmärkt sätt att komma igång är att kika på <a href="http://guide.couchdb.org/">onlineboken här</a> eller <a href="http://voyager.lnu.se/tekinet/kurser/dtt/2DV407/index.php?sida=html%2F2011%2Fresurser%2Fcouchdb">Couch-sidan</a> på förra årets kurswebb.</p>
<h4>MongoDB</h4>
<img class="logo" src="img/mongodb-logo.png"/>
<p> och <a href="http://www.mongodb.org/">MongoDB</a> wee moo.</p>

				<h3 id="test">Unit Testing</h3>
				<p>bla bla yada yada BDD TDD wooo!</p>
				
				<ul>
					<li>Vows</li>
					<li>Jasmine</li>
					<li>QUnit</li>
					<li>JSTestDriver</li>
				</ul>

			</div>
			<div id="footer">
&copy; Linnéuniversitetet &amp; David Waller 2012
			</div>
		</div>
		<script src="js/jquery-1.7.1-min.js" type="text/javascript" id="jquery"></script>
		<script src="js/krawnav.js" type="text/javascript"></script>
		<script src="syntaxhighlighter/shCore.js" type="text/javascript"></script>
		<script src="syntaxhighlighter/shBrushJScript.js" type="text/javascript"></script>
		<script src="js/riaweb.js" type="text/javascript"></script>

	</body>
</html>
